#ifndef MAPS_H
#define MAPS_H

#define MAIN_MENU_MAP "\
ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ   ÛÛÛÛÛÛÛÛปÛÛÛÛÛÛป  ÛÛÛÛÛÛป ÛÛÛป   ÛÛป                                       บ\n\
บ   ศออÛÛษออผÛÛษออÛÛปÛÛษอออÛÛปÛÛÛÛป  ÛÛบ                                       บ\n\
บ      ÛÛบ   ÛÛÛÛÛÛษผÛÛบ   ÛÛบÛÛษÛÛป ÛÛบ                                       บ\n\
บ      ÛÛบ   ÛÛษออÛÛปÛÛบ   ÛÛบÛÛบศÛÛปÛÛบ                                       บ\n\
บ      ÛÛบ   ÛÛบ  ÛÛบศÛÛÛÛÛÛษผÛÛบ ศÛÛÛÛบ                                       บ\n\
บ      ศอผ   ศอผ  ศอผ ศอออออผ ศอผ  ศอออผ                                       บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
ฬออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออน\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ"

#define INFO_MAP "\
ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป\n\
บ         ÛÛÛÛÛÛป ÛÛป  ÛÛปÛÛÛÛÛÛป ÛÛÛÛÛÛÛป      ÛÛป   ÛÛปÛÛÛÛÛÛป               บ\n\
บ         ศออออÛÛปÛÛบ  ÛÛบÛÛษออÛÛปÛÛษออออผ      ÛÛบ   ÛÛบศออออÛÛป              บ\n\
บ          ÛÛÛÛÛษผÛÛÛÛÛÛÛบÛÛÛÛÛÛษผÛÛÛÛÛÛÛปÛÛÛÛÛปÛÛบ   ÛÛบ ÛÛÛÛÛษผ              บ\n\
บ          ศอออÛÛปศออออÛÛบÛÛษออÛÛปศออออÛÛบศออออผศÛÛป ÛÛษผÛÛษอออผ               บ\n\
บ         ÛÛÛÛÛÛษผ     ÛÛบÛÛÛÛÛÛษผÛÛÛÛÛÛÛบ       ศÛÛÛÛษผ ÛÛÛÛÛÛÛป              บ\n\
บ         ศอออออผ      ศอผศอออออผ ศออออออผ        ศอออผ  ศออออออผ              บ\n\
บ                                                                              บ\n\
บ  ใเแฎข ๏ เ กฎโ  ฏฎ ฏเฎฃเ ฌฌจเฎข ญจ๎ ญ  ‘++                                  บ\n\
บ                                                                              บ\n\
บ  ๋ฏฎซญจซ:  ซฎจข ญ €ซฅชแฅฉ €ซฅชแ ญคเฎขจ็                                    บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ   ซ๏ ข๋ๅฎค  ข ฎแญฎขญฎฅ ฌฅญ๎ ญ ฆฌจโฅ ชซ ขจ่ใ \"ESC\".                          บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ"

#define CANVAS_MAP "\
ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออหอออออออออป\n\
บ                                                                    บ  SCORE  บ\n\
บ                                                                    บ         บ\n\
บ                                                                    ฬอออออออออน\n\
บ                                                                    บ         บ\n\
บ                                                                    บ         บ\n\
บ                                                                    ฬอออออออออน\n\
บ                                                                    บ         บ\n\
บ                                                                    บ         บ\n\
บ                                                                    ฬอออออออออน\n\
บ                                                                    บ         บ\n\
บ                                                                    บ         บ\n\
บ                                                                    ฬอออออออออน\n\
บ                                                                    บ    T    บ\n\
บ                                                                    บ    R    บ\n\
บ                                                                    บ    O    บ\n\
บ                                                                    บ    N    บ\n\
บ                                                                    บ         บ\n\
บ                                                                    บ    G    บ\n\
บ                                                                    บ    A    บ\n\
บ                                                                    บ    M    บ\n\
บ                                                                    บ    E    บ\n\
บ                                                                    บ         บ\n\
บ                                                                    บ         บ\n\
ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออสอออออออออผ"

#define GAME_OVER_MAP "\
ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ              _____ _____ _____ _____    _____ _____ _____ _____              บ\n\
บ             |   __|  _  |     |   __|  |     |  |  |   __| __  |             บ\n\
บ             |  |  |     | | | |   __|  |  |  |  |  |   __|    -|             บ\n\
บ             |_____|__|__|_|_|_|_____|  |_____|\\___/|_____|__|__|             บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ"

#define INFO_STAT_MAP "\
ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป\n\
บ            ______    _______  ___   _______  ___   __    _  _______          บ\n\
บ           |    _ |  |   _   ||   | |       ||   | |  |  | ||       |         บ\n\
บ           |   | ||  |  |_|  ||   | |_     _||   | |   |_| ||    ___|         บ\n\
บ           |   |_||_ |       ||   |   |   |  |   | |       ||   | __          บ\n\
บ           |    __  ||       ||   |   |   |  |   | |  _    ||   ||  |         บ\n\
บ           |   |  | ||   _   ||   |   |   |  |   | | | |   ||   |_| |         บ\n\
บ           |___|  |_||__| |__||___|   |___|  |___| |_|  |__||_______|         บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
บ                                                                              บ\n\
ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ"
#endif // !MAPS_H